M-o-a-T/diyBMS-code/ESP8266Controller/src/main.cpp
/*

 ____  ____  _  _  ____  __  __  ___    _  _  __
(  _ \(_  _)( \/ )(  _ \(  \/  )/ __)  ( \/ )/. |
 )(_) )_)(_  \  /  ) _ < )    ( \__ \   \  /(_  _)
(____/(____) (__) (____/(_/\/\_)(___/    \/   (_)

  (c) 2017/18/19/20 Stuart Pittaway

  This is the code for the controller - it talks to the V4.X cell modules over isolated serial bus

  This code runs on ESP-8266 WEMOS D1 (Mini or Pro) and compiles with VS CODE and PLATFORM IO environment
*/

/*
   ESP8266 PINS
   D0 = GREEN_LED
   D1 = i2c SDA
   D2 = i2c SCL
   D3 = switch to ground (reset WIFI configuration on power up)
   D4 = GPIO2 = TXD1 = TRANSMIT DEBUG SERIAL (and blue led on esp8266)
   D5 = GPIO14 = Interrupt in from PCF8574
   D7 = GPIO13 = RECEIVE SERIAL
   D8 = GPIO15 = TRANSMIT SERIAL

*/

#include <Arduino.h>

//#define PACKET_LOGGING_RECEIVE
//#define PACKET_LOGGING_SEND
//#define RULES_LOGGING
//#define MQTT_LOGGING

#include "FS.h"

//Libraries just for ESP8266

#include <TimeLib.h>
#include <ESP8266WiFi.h>
#include <NtpClientLib.h>
#include <LittleFS.h>
#include <ESP8266mDNS.h>

#include <Ticker.h>
#include <ESPAsyncWebServer.h>
#include <AsyncMqttClient.h>

#include "defines.h"
#include "serializer.h"

#include <ArduinoOTA.h>

#include "HAL_ESP8266.h"
HAL_ESP8266 hal;

#include "Rules.h"

volatile bool emergencyStop = false;

Rules rules;

bool _sd_card_installed = false;
diybms_eeprom_settings mysettings;
uint16_t ConfigHasChanged = 0;

uint16_t TotalNumberOfCells() { return mysettings.totalNumberOfBanks * mysettings.totalNumberOfSeriesModules; }

bool server_running = false;
RelayState previousRelayState[RELAY_TOTAL];
bool previousRelayPulse[RELAY_TOTAL];

volatile enumInputState InputState[INPUTS_TOTAL];

bool NTPsyncEventTriggered = false; // True if a time even has been triggered
NTPSyncEvent_t ntpEvent;            // Last triggered event

AsyncWebServer server(80);

void IRAM_ATTR ExternalInputInterrupt()
{
  if ((hal.ReadInputRegisters() & B00010000) == 0)
  {
    //Emergency Stop (J1) has triggered
    emergencyStop = true;
  }
}

//This large array holds all the information about the modules
//up to 4x16
CellModuleInfo cmi[maximum_controller_cell_modules];

#include "crc16.h"

#include "settings.h"
#include "SoftAP.h"
#include "DIYBMSServer.h"

WiFiEventHandler wifiConnectHandler;
WiFiEventHandler wifiDisconnectHandler;

Ticker myTimerRelay;
Ticker myTimer;
Ticker myTransmitTimer;
Ticker myReplyTimer;
Ticker myLazyTimer;
Ticker wifiReconnectTimer;
Ticker mqttReconnectTimer;
Ticker myTimerSendMqttPacket;
Ticker myTimerSendMqttStatus;
Ticker myTimerSendInfluxdbPacket;
Ticker myTimerSwitchPulsedRelay;

ControllerState ControlState = ControllerState::Unknown;

bool OutputsEnabled;
bool InputsEnabled;

AsyncMqttClient mqttClient;

void dumpByte(uint8_t data)
{
  if (data <= 0x0F)
    SERIAL_DEBUG.print('0');
  SERIAL_DEBUG.print(data, HEX);
}
void dumpPacketToDebug(char indicator, PacketMeta *meta)
{
  //Filter on selected commands
  //if ((buffer->command & 0x0F) != COMMAND::Timing)    return;

  PacketHeader *header = (PacketHeader *)(meta+1);

  SERIAL_DEBUG.print(millis());
  SERIAL_DEBUG.print(':');

  SERIAL_DEBUG.print(indicator);

  SERIAL_DEBUG.print(':');
  dumpByte(header->start);
  SERIAL_DEBUG.print('-');
  dumpByte(header->start+header->cells);
  SERIAL_DEBUG.print('/');
  dumpByte(header->hops);
  SERIAL_DEBUG.print('/');
  dumpByte(header->command);
  SERIAL_DEBUG.print(' ');

  //TODO: Could store these in PROGMEM char array
  switch (header->command & 0x0F)
  {
  case COMMAND::ResetPacketCounters:
    SERIAL_DEBUG.print(F("ResetC   "));
    break;
  case COMMAND::ReadVoltageAndStatus:
    SERIAL_DEBUG.print(F("RdVolt   "));
    break;
  case COMMAND::Identify:
    SERIAL_DEBUG.print(F("Ident    "));
    break;
  case COMMAND::ReadTemperature:
    SERIAL_DEBUG.print(F("RdTemp   "));
    break;
  case COMMAND::ReadPacketCounters:
    SERIAL_DEBUG.print(F("RdPkC "));
    break;
  case COMMAND::ReadSettings:
    SERIAL_DEBUG.print(F("RdSettin "));
    break;
  case COMMAND::WriteSettings:
    SERIAL_DEBUG.print(F("WriteSet "));
    break;
  case COMMAND::ReadBalancePowerPWM:
    SERIAL_DEBUG.print(F("RdBalanc "));
    break;
  case COMMAND::Timing:
    SERIAL_DEBUG.print(F("Timing   "));
    break;
  case COMMAND::ReadBalanceCurrentCounter:
    SERIAL_DEBUG.print(F("Bal mAh  "));
    break;
  case COMMAND::WriteBalanceLevel:
    SERIAL_DEBUG.print(F("SetBal  "));
  default:
    SERIAL_DEBUG.print(F("??????   "));
    break;
  }

  SERIAL_DEBUG.printf("%.1X", header->sequence);
  //SERIAL_DEBUG.print(header->sequence, HEX);
  SERIAL_DEBUG.print('=');
  uint8_t *data = (uint8_t *)(header+1);
  for (size_t i = 0; i < meta->dataLen; i++,data++)
  {
    //SERIAL_DEBUG.print(header->moduledata[i], HEX);
    SERIAL_DEBUG.printf("%.2X", data);
    SERIAL_DEBUG.print(" ");
  }
  SERIAL_DEBUG.println();
}

const char *ControllerStateString(ControllerState value)
{
  switch (value)
  {
  case ControllerState::PowerUp:
    return "PowerUp";
  case ControllerState::ConfigurationSoftAP:
    return "ConfigurationSoftAP";
  case ControllerState::Stabilizing:
    return "Stabilizing";
  case ControllerState::Running:
    return "Running";
  case ControllerState::Unknown:
    return "Unknown";
  }

  return "?";
}

void SetControllerState(ControllerState newState)
{
  if (ControlState != newState)
  {
    ControlState = newState;

    SERIAL_DEBUG.println("");
    SERIAL_DEBUG.print(F("** Controller changed to state = "));
    SERIAL_DEBUG.println(ControllerStateString(newState));
  }
}

uint16_t minutesSinceMidnight()
{

  return (hour() * 60) + minute();
}

void processSyncEvent(NTPSyncEvent_t ntpEvent)
{
  if (ntpEvent < 0)
  {
    SERIAL_DEBUG.printf("Time Sync error: %d\n", ntpEvent);
    /*
    if (ntpEvent == noResponse)
      SERIAL_DEBUG.println(F("NTP svr not reachable"));
    else if (ntpEvent == invalidAddress)
      SERIAL_DEBUG.println(F("Invalid NTP svr address"));
    else if (ntpEvent == errorSending)
      SERIAL_DEBUG.println(F("Error sending request"));
    else if (ntpEvent == responseError)
      SERIAL_DEBUG.println(F("NTP response error"));
      */
  }
  else
  {
    if (ntpEvent == timeSyncd)
    {
      SERIAL_DEBUG.print(F("NTP time "));
      time_t lastTime = NTP.getLastNTPSync();
      SERIAL_DEBUG.println(NTP.getTimeDateString(lastTime));
      setTime(lastTime);
    }
  }
}

