M-o-a-T/diyBMS-code/ESP8266Controller/src/main.cpp
        // NOTE: if updating SPIFFS this would be the place to unmount SPIFFS using SPIFFS.end()
        SERIAL_DEBUG.println("Start updating " + type);
      });
  ArduinoOTA.onEnd([]() {
    SERIAL_DEBUG.println("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    SERIAL_DEBUG.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    SERIAL_DEBUG.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR)
      SERIAL_DEBUG.println("Auth Failed");
    else if (error == OTA_BEGIN_ERROR)
      SERIAL_DEBUG.println("Begin Failed");
    else if (error == OTA_CONNECT_ERROR)
      SERIAL_DEBUG.println("Connect Failed");
    else if (error == OTA_RECEIVE_ERROR)
      SERIAL_DEBUG.println("Receive Failed");
    else if (error == OTA_END_ERROR)
      SERIAL_DEBUG.println("End Failed");
  });

  ArduinoOTA.begin();
}

sdcard_info sdcard_callback()
{
  //Fake
  sdcard_info ret;
  ret.available = _sd_card_installed;
  ret.totalkilobytes = 0;
  ret.usedkilobytes = 0;
  ret.flash_totalkilobytes = 0;
  ret.flash_usedkilobytes = 0;
  return ret;
}
void sdcardaction_callback(uint8_t action)
{
  //Fake
  _sd_card_installed = false;
}

void onWifiConnect(const WiFiEventStationModeGotIP &event)
{

  SERIAL_DEBUG.print(F("onWifiConnect status="));
  SERIAL_DEBUG.println(WiFi.status());
  SERIAL_DEBUG.print(F("Connected IP:"));
  SERIAL_DEBUG.println(WiFi.localIP());
  SERIAL_DEBUG.print(F("Hostname:"));
  SERIAL_DEBUG.println(WiFi.hostname().c_str());

  //SERIAL_DEBUG.print(F("Request NTP from "));
  //SERIAL_DEBUG.println(mysettings.ntpServer);

  //Update time every 20 minutes
  NTP.setInterval(1200);
  NTP.setNTPTimeout(NTP_TIMEOUT);
  // String ntpServerName, int8_t timeZone, bool daylight, int8_t minutes, AsyncUDP* udp_conn
  NTP.begin(mysettings.ntpServer, mysettings.timeZone, mysettings.daylight, mysettings.minutesTimeZone);

  /*
  TODO: CHECK ERROR CODES BETTER!
  0 : WL_IDLE_STATUS when Wi-Fi is in process of changing between statuses
  1 : WL_NO_SSID_AVAIL in case configured SSID cannot be reached
  3 : WL_CONNECTED after successful connection is established
  4 : WL_CONNECT_FAILED if password is incorrect
  6 : WL_DISCONNECTED if module is not configured in station mode
  */
  if (!server_running)
  {
    DIYBMSServer::StartServer(&server, &mysettings, &sdcard_callback, &transmitProc, &receiveProc, &ControlState, &rules, &sdcardaction_callback);
    server_running = true;
  }

  if (mysettings.mqtt_enabled)
  {
    connectToMqtt();
  }

  if (mysettings.influxdb_enabled)
  {
    startTimerToInfluxdb();
  }

  SetupOTA();

  // Set up mDNS responder:
  // - first argument is the domain name, in this example
  //   the fully-qualified domain name is "esp8266.local"
  // - second argument is the IP address to advertise
  //   we send our IP address on the WiFi network

  if (MDNS.begin(WiFi.hostname().c_str(), WiFi.localIP()))
  {
    // Add service to MDNS-SD
    MDNS.addService("http", "tcp", 80);
  }
  else
  {
    SERIAL_DEBUG.println("Error setting up MDNS responder!");
  }
}

void onWifiDisconnect(const WiFiEventStationModeDisconnected &event)
{
  SERIAL_DEBUG.println(F("Disconnected from Wi-Fi."));

  // ensure we don't reconnect to MQTT while reconnecting to Wi-Fi
  mqttReconnectTimer.detach();
  myTimerSendMqttPacket.detach();
  myTimerSendMqttStatus.detach();
  myTimerSendInfluxdbPacket.detach();

  NTP.stop();
  MDNS.end();
}

void onMqttDisconnect(AsyncMqttClientDisconnectReason reason)
{
  SERIAL_DEBUG.println(F("Disconnected from MQTT."));

  myTimerSendMqttPacket.detach();
  myTimerSendMqttStatus.detach();

  if (WiFi.isConnected())
  {
    mqttReconnectTimer.once(2, connectToMqtt);
  }
}

void sendMqttStatus()
{
  if (!mysettings.mqtt_enabled && !mqttClient.connected())
    return;

  char topic[80];
  char jsonbuffer[220];
  DynamicJsonDocument doc(220);
  JsonObject root = doc.to<JsonObject>();

  root["banks"] = mysettings.totalNumberOfBanks;
  root["cells"] = mysettings.totalNumberOfSeriesModules;
  root["uptime"] = millis() / 1000; // I want to know the uptime of the device.

  // Set error flag if we have attempted to send 2*number of banks without a reply
  root["commserr"] = receiveProc.HasCommsTimedOut() ? 1 : 0;
  root["sent"] = transmitProc.packetsGenerated;
  root["received"] = receiveProc.packetsReceived;
  root["badcrc"] = receiveProc.totalCRCErrors;
  root["ignored"] = receiveProc.totalNotProcessedErrors;
  root["oos"] = receiveProc.totalOutofSequenceErrors;
  root["roundtrip"] = receiveProc.packetTimerMillisecond;

  serializeJson(doc, jsonbuffer, sizeof(jsonbuffer));
  sprintf(topic, "%s/status", mysettings.mqtt_topic);
  mqttClient.publish(topic, 0, false, jsonbuffer);
#if defined(MQTT_LOGGING)
  SERIAL_DEBUG.print("MQTT - ");
  SERIAL_DEBUG.print(topic);
  SERIAL_DEBUG.print('=');
  SERIAL_DEBUG.println(jsonbuffer);
#endif
  //Output bank level information (just voltage for now)
  for (int8_t bank = 0; bank < mysettings.totalNumberOfBanks; bank++)
  {
    doc.clear();
    doc["voltage"] = (float)rules.packvoltage[bank] / (float)1000.0;

    serializeJson(doc, jsonbuffer, sizeof(jsonbuffer));
    sprintf(topic, "%s/bank/%d", mysettings.mqtt_topic, bank);
    mqttClient.publish(topic, 0, false, jsonbuffer);
#if defined(MQTT_LOGGING)
    SERIAL_DEBUG.print("MQTT - ");
    SERIAL_DEBUG.print(topic);
    SERIAL_DEBUG.print('=');
    SERIAL_DEBUG.println(jsonbuffer);
#endif
  }

  //Using Json for below reduced MQTT messages from 14 to 2. Could be combined into same json object too. But even better is status + event driven.
  doc.clear(); // Need to clear the json object for next message
  sprintf(topic, "%s/rule", mysettings.mqtt_topic);
  for (uint8_t i = 0; i < RELAY_RULES; i++)
  {
    doc[(String)i] = rules.rule_outcome[i] ? 1 : 0; // String conversion should be removed but just quick to get json format nice
  }
  serializeJson(doc, jsonbuffer, sizeof(jsonbuffer));
#if defined(MQTT_LOGGING)
  SERIAL_DEBUG.print("MQTT - ");
  SERIAL_DEBUG.print(topic);
  SERIAL_DEBUG.print('=');
  SERIAL_DEBUG.println(jsonbuffer);
#endif
  mqttClient.publish(topic, 0, false, jsonbuffer);

  doc.clear(); // Need to clear the json object for next message
  sprintf(topic, "%s/output", mysettings.mqtt_topic);
  for (uint8_t i = 0; i < RELAY_TOTAL; i++)
  {
    doc[(String)i] = (previousRelayState[i] == RelayState::RELAY_ON) ? 1 : 0;
  }

