M-o-a-T/diyBMS-code/ESP8266Controller/src/main.cpp
  initSerializer();

  //Temporarly force WIFI settings
  //wifi_eeprom_settings xxxx;
  //strcpy(xxxx.wifi_ssid,"XXXXXX");
  //strcpy(xxxx.wifi_passphrase,"XXXXXX");
  //Settings::WriteConfigToEEPROM((char*)&xxxx, sizeof(xxxx), EEPROM_WIFI_START_ADDRESS);
  //clearAPSettings = 0;

  if (!DIYBMSSoftAP::LoadConfigFromEEPROM() || clearAPSettings == 0)
  {
    //We have just started...
    SetControllerState(ControllerState::ConfigurationSoftAP);

    SERIAL_DEBUG.print(F("Clear AP settings"));
    SERIAL_DEBUG.println(clearAPSettings);
    SERIAL_DEBUG.println(F("Setup Access Point"));
    //We are in initial power on mode (factory reset)
    DIYBMSSoftAP::SetupAccessPoint(&server);
  }
  else
  {

    //Config NTP
    NTP.onNTPSyncEvent([](NTPSyncEvent_t event) {
      ntpEvent = event;
      NTPsyncEventTriggered = true;
    });

    SERIAL_DEBUG.println(F("Connecting to WIFI"));

    /* Explicitly set the ESP8266 to be a WiFi-client, otherwise by default,
      would try to act as both a client and an access-point */

    wifiConnectHandler = WiFi.onStationModeGotIP(onWifiConnect);
    wifiDisconnectHandler = WiFi.onStationModeDisconnected(onWifiDisconnect);

    mqttClient.onConnect(onMqttConnect);
    mqttClient.onDisconnect(onMqttDisconnect);

    if (mysettings.mqtt_enabled)
    {
      SERIAL_DEBUG.println("MQTT Enabled");
      mqttClient.setServer(mysettings.mqtt_server, mysettings.mqtt_port);
      mqttClient.setCredentials(mysettings.mqtt_username, mysettings.mqtt_password);
    }

    //Ensure we service the cell modules every 5 or 10 seconds, depending on number of cells being serviced
    //slower stops the queues from overflowing when a lot of cells are being monitored
    myTimer.attach((TotalNumberOfCells() <= maximum_cell_modules_per_packet) ? 5 : 10, timerEnqueueCallback);

    //Process rules every 5 seconds
    myTimerRelay.attach(5, timerProcessRules);

    // We process the transmit queue every 1/10th second. The transmitter
    // takes care not to overrun the serial link.
    myTransmitTimer.attach(0.1, timerTransmitCallback);

    //Service reply queue
    myReplyTimer.attach(0.1, serviceReplyQueue);

    //This is a lazy timer for low priority tasks
    myLazyTimer.attach(8, timerLazyCallback);

    //We have just started...
    SetControllerState(ControllerState::Stabilizing);

    //Attempt connection in setup(), loop() will also try every 30 seconds
    connectToWifi();
  }
}

unsigned long wifitimer = 0;

void loop()
{
  //ESP_LOGW("LOOP","LOOP");
  unsigned long currentMillis = millis();

  if (ControlState != ControllerState::ConfigurationSoftAP)
  {
    //on first pass wifitimer is zero
    if (currentMillis - wifitimer > 30000)
    {
      //Attempt to connect to WiFi every 30 seconds, this caters for when WiFi drops
      //such as AP reboot, its written to return without action if we are already connected
      connectToWifi();
      wifitimer = currentMillis;
    }
  }

  ArduinoOTA.handle();

  // Call update to receive, decode and process incoming packets.
  myPacketSerial.checkInputStream();

  if (NTPsyncEventTriggered)
  {
    processSyncEvent(ntpEvent);
    NTPsyncEventTriggered = false;
  }

  MDNS.update();
}
